cuboFiles/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
     inlet
    {
        type            fixedValue;
        value           uniform (0.005 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    ground
    {
        type            empty;
    }

    top
    {
        type            empty;
    }
	
	front
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
	
	back
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
	
	

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
