cuboFiles/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

	outlet
    {
        type            calculated;
        value           uniform 0;
    }
	
    ground
    {
        type            empty;
    }
	
	top
    {
        type            empty;
    }
    
	front
    {
        type            calculated;
        value           uniform 0;
    }
	
	back
    {
        type            calculated;
        value           uniform 0;
    }
	
	
	#includeEtc "caseDicts/setConstraintTypes"

}


// ************************************************************************* //
